gauya/bluepill_cube/lib/stm32/src/gadc.cpp
#include "gadc.h"
#include <glog.h>

#ifdef __cplusplus
extern "C" {
#endif

DMA_HandleTypeDef hdma_adc1,hdma_adc2;
ADC_HandleTypeDef hadc1,hadc2;

int adc_completed = 0;

#if 1  // debugging
int dma_finish1 = 0;
int dma_finish2 = 0;
extern uint16_t *adc_buffer;
void (*_stm32adc_callback)() = 0;
int adc_mode=1;
int adc_count=0;
#endif

gadc __adc1;

int HUL_ADC_clk_enable(ADC_TypeDef *adc);
int HUL_GPIO_clk_enable(GPIO_TypeDef *gpio);
int HUL_ADC_nvic(ADC_TypeDef *adc, int enable);

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
  if( _stm32adc_callback ) {
    _stm32adc_callback();
  }
  __adc1.safedata();
  adc_completed++;
  
  if( adc_mode == 1) {

  } else {

  }
}

void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc) {
  //dma_finish1++;
}

void HAL_DMA_TransferCpltCallback(DMA_HandleTypeDef *hdma) {
  //dma_finish2++;
}

#if 1 // F1
void ADC1_2_IRQHandler(void) {
  HAL_ADC_IRQHandler(&hadc1); 
}

void DMA1_Channel1_IRQHandler(void) {
  HAL_DMA_IRQHandler(&hdma_adc1);
  dma_finish2++;
}
#else
void ADC_IRQHandler(void) {
  HAL_ADC_IRQHandler(&hadc1);
}
void DMA2_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&hdma_adc1);
}
#endif

int HUL_ADC_clk_enable(ADC_TypeDef *adc) {
#if defined(ADC1)
  if (adc == ADC1) {
    __HAL_RCC_ADC1_CLK_ENABLE();
    return 1;
  } 
#endif
#if defined(ADC2)
  if (adc == ADC2) {
    __HAL_RCC_ADC2_CLK_ENABLE();
    return 1;
  } 
#endif
#if defined(ADC3)
  if (adc == ADC3) {
    __HAL_RCC_ADC3_CLK_ENABLE();
    return 1;
  } 
#endif
  return 0;
}

int HUL_GPIO_clk_enable(GPIO_TypeDef *gpio) {
//__HAL_RCC_GPIOA_CLK_ENABLE
  if( ! IS_GPIO_ALL_INSTANCE(gpio) ) 
    return 0;
#if defined(GPIOA)
  if( gpio == GPIOA ) {
    __HAL_RCC_GPIOA_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOB)
  if( gpio == GPIOB ) {
    __HAL_RCC_GPIOB_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOC)
  if( gpio == GPIOC ) {
    __HAL_RCC_GPIOC_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOD)
  if( gpio == GPIOD ) {
    __HAL_RCC_GPIOD_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOE)
  if( gpio == GPIOE ) {
    __HAL_RCC_GPIOE_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOF)
  if( gpio == GPIOFF ) {
    __HAL_RCC_GPIOF_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOG)
  if( gpio == GPIOG ) {
    __HAL_RCC_GPIOG_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOH)
  if( gpio == GPIOH ) {
    __HAL_RCC_GPIOH_CLK_ENABLE();
    return 1;
  }
#endif
  return 0;
}


int HUL_ADC_nvic(ADC_TypeDef *adc, int enable) {
#if 1 // F1  
  if( ADC1 == adc ) {
    if( enable ) {
      HAL_NVIC_SetPriority(ADC1_2_IRQn, 0, 0); // M4 ADC_IRQn
      HAL_NVIC_EnableIRQ(ADC1_2_IRQn);
      return 1;
    } else {
      HAL_NVIC_DisableIRQ(ADC1_2_IRQn);
      return 0;
    }
  } else return -1;
#else 
  if( ADC1 == adc ) {
    if( enable ) {
      HAL_NVIC_SetPriority(ADC1_IRQn, 0, 0); // M4 ADC_IRQn
      HAL_NVIC_EnableIRQ(ADC1_IRQn);
      return 1;
    } else {
      HAL_NVIC_DisableIRQ(ADC1_IRQn);
      return 0;
    }
  }  else return -1;
}
#endif
}

int HUL_DMA_nvic(ADC_TypeDef *adc, int enable) {
#if 1 // F1  
  if( ADC1 == adc ) {
    if( enable ) {
      __HAL_RCC_DMA1_CLK_ENABLE();

      HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
      HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);      

      return 1;
    } else {
      HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);   
      return 0;
    }

  } else return -1;
#else // F4
  if( ADC1 == adc ) {
    if( enable ) {
      __HAL_RCC_DMA2_CLK_ENABLE();
      HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 0, 0);
      HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
  
      return 1;
    } else {

      return 0;
    }
  }  else return -1;
#endif
}

/**
* @brief ADC MSP Initialization
* This function configures the hardware resources used in this example
* @param hadc: ADC handle pointer
* @retval None
*/
void HAL_ADC_MspInit(ADC_HandleTypeDef* hadc)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if(hadc->Instance==ADC1)
  {
  /* USER CODE BEGIN ADC1_MspInit 0 */

  /* USER CODE END ADC1_MspInit 0 */
    /* Peripheral clock enable */
    __HAL_RCC_ADC1_CLK_ENABLE();

    __HAL_RCC_GPIOA_CLK_ENABLE();
    /**ADC1 GPIO Configuration
    PA0-WKUP     ------> ADC1_IN0
    PA1     ------> ADC1_IN1
    PA2     ------> ADC1_IN2
    PA3     ------> ADC1_IN3
    PA4     ------> ADC1_IN4
    */
    GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3
                          |GPIO_PIN_4;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* ADC1 DMA Init */
    /* ADC1 Init */
    hdma_adc1.Instance = DMA1_Channel1;
    hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;
    hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hdma_adc1.Init.Mode = DMA_CIRCULAR;
    hdma_adc1.Init.Priority = DMA_PRIORITY_LOW;
    if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
    {
      Error_Handler();
    }

    __HAL_LINKDMA(hadc,DMA_Handle,hdma_adc1);

    /* ADC1 interrupt Init */
    HAL_NVIC_SetPriority(ADC1_2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(ADC1_2_IRQn);
  /* USER CODE BEGIN ADC1_MspInit 1 */

  /* USER CODE END ADC1_MspInit 1 */
  }

}


/**
* @brief ADC MSP De-Initialization
* This function freeze the hardware resources used in this example
* @param hadc: ADC handle pointer
* @retval None
*/
void HAL_ADC_MspDeInit(ADC_HandleTypeDef* hadc)
{
  if(hadc->Instance==ADC1)
  {
  /* USER CODE BEGIN ADC1_MspDeInit 0 */

  /* USER CODE END ADC1_MspDeInit 0 */
    /* Peripheral clock disable */
    __HAL_RCC_ADC1_CLK_DISABLE();

    /**ADC1 GPIO Configuration
    PA0-WKUP     ------> ADC1_IN0
    PA1     ------> ADC1_IN1
    PA2     ------> ADC1_IN2
    PA3     ------> ADC1_IN3
    PA4     ------> ADC1_IN4
    */
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3
                          |GPIO_PIN_4);

    /* ADC1 DMA DeInit */
    HAL_DMA_DeInit(hadc->DMA_Handle);

