gauya/bluepill_cube/lib/stm32/src/gadc.cpp
void gadc::safedata() {
  if( !_dmabuf ) return;

  memmove(_outbuf, _dmabuf, channel_num() * sizeof(_outbuf[0]));
  _data_ready = 1;
}

int gadc::read(int ch) {
  if( !_outbuf ) { 
    return (-1);
  }
  return _outbuf[ch];
}

int gadc::read(uint16_t *buf) {
  if( !_data_ready || !buf ) {
    return -1;
  }
  memmove(buf, _outbuf, sizeof(_outbuf[0]) * channel_num());

  _data_ready = 0;
  return channel_num();
}
// -----------------------------------------------------------------------------------------------

#if 0
void HAL_DMA_TransferCpltCallback(DMA_HandleTypeDef *hdma) {
  // 버퍼 처리 (예: 데이터 분석, 전송 등)
  dma_finish1++;
}

void HAL_DMA_StreamTransferCpltCallback(DMA_HandleTypeDef *hdma) {
  // DMA 재시작 (연속 읽어오기)

  HAL_DMA_Start_IT(hdma, (uint32_t)&ADC1->DR, (uint32_t)adc_buffer, 7);
}
#endif

#if 0
int adc_completed = 0;
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
  adc_completed++;

  if( _stm32adc_callback  ) {
    _stm32adc_callback();
  }


  adc_data[0] = HAL_ADC_GetValue(hadc, ADC_CHANNEL_1);
  adc_data[1] = HAL_ADC_GetValue(hadc, ADC_CHANNEL_2);
  ...


  HAL_ADC_Start_IT(hadc);
}
#endif

#ifdef __cplusplus
}
#endif

stm32adc::stm32adc() { //LSE_STARTUP_TIMEOUT
  _channel_num = 0;
  _timeout = 100; // ms
  _status = eADC_NOTSETUP; // -1
  _mode = eADC_POLLING; // 0       (_mode & 0x7)
}

//#include <stm32f4xx_hal.h>

stm32adc::stm32adc(ADC_TypeDef *adc, struct adc_channels *ac) {
  if(adc == ADC1) {
    _ha = &hadc1;
  } else {
  //if(adc == ADC2) {
    return;
    //_ha = &hadc2;
  }
  _channel_num = 0;
  _timeout = 100; // ms
  _status = eADC_NOTSETUP; // -1
  _mode = eADC_POLLING; // 0       (_mode & 0x7)

//  setup(adc, ac);
}

void stm32adc::setup(ADC_TypeDef *adc, struct adc_channels *ac) {
  _status = -1;
  if(adc == ADC1) {
    _ha = &hadc1;
  } else {
  //if(adc == ADC2) {
    return;
    //_ha = &hadc2;
  }
  HUL_ADC_clk_enable(_ha->Instance);

  _ha->Instance = adc;
  _channel_num = 0;
  _timeout = 1; // ms
  _status = 0;
 
  int chs = 0;
  for(; (ac+chs)->ch != -1 ; chs++);
  
  _ha->Init.ExternalTrigConv = ADC_SOFTWARE_START;
  _ha->Init.DataAlign = ADC_DATAALIGN_RIGHT;
  _ha->Init.NbrOfConversion = chs;                   // <> _channel_num
  _ha->Init.DiscontinuousConvMode = DISABLE;
  _ha->Init.ScanConvMode = ENABLE; //DISABLE; // ENABLE
  _ha->Init.ContinuousConvMode = DISABLE;

  HUL_ADC_clk_enable(adc);

// multi, continues, use dma
#if defined(STM32F4) || defined(STM32F7)
  _ha->Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  _ha->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  _ha->Init.Resolution = ADC_RESOLUTION_12B;
  _ha->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  if( _mode == eADC_DMA || _mode == eADC_DMAINTERRUPT ) {
    _ha->Init.DMAContinuousRequests = ENABLE;
  } else {
    _ha->Init.DMAContinuousRequests = DISABLE;
  }
#endif //STM32F4

  if (HAL_ADC_Init(_ha) != HAL_OK) // --> call HAL_ADC_MspInit()
  {
    ERROR_LOG(""); //Error_Handler();
  }

  _chs = ac;

  for(uint8_t i=0; i < _ha->Init.NbrOfConversion; i++) {
    add_channel(ac+i);
  }

  //HAL_ADC_TempSensor_Enable();
  //HAL_ADC_TempSensorVrefintCmd(ENABLE);
  //while(HAL_ADCEx_Calibration_Start(&_ha) != HAL_OK);
  //HAL_ADC_SelfCalibration_Start();
  //HAL_ADC_Calibration_Start();
  
  /* Set ADC number of conversion */
  //hadc->Instance->SQR1 &= ~(ADC_SQR1_L);
  //hadc->Instance->SQR1 |=  ADC_SQR1(hadc->Init.NbrOfConversion);

  _status = 0;
}

int stm32adc::add_channel(uint32_t ch,uint32_t samplerate) {
  ADC_ChannelConfTypeDef sConfig = {0};
  sConfig.Channel = ch;
  sConfig.SamplingTime = samplerate; // default ADC_SAMPLETIME_84CYCLES; 
  sConfig.Rank = ++_channel_num; // 1 ~ ,  

  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_LOG("add adc channel"); //Error_Handler();
  }

  return  _channel_num; // rank is auto increase sequentially
}

int stm32adc::add_channel(struct adc_channels *ac) {
  ADC_ChannelConfTypeDef sConfig = {0};
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  
  sConfig.Channel = ac->ch;
  sConfig.Rank = ac->rank = _channel_num; // 0~ order by
  sConfig.SamplingTime = ac->sampling; //ADC_SAMPLETIME_3CYCLES;
  
  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_LOG("add adc channel"); //Error_Handler();
  }

  if( ac->port != 0 ) { // not Vrefint, temperture, ..
    // ---> HUL_GPIO_CLK_Enable(ac->port)
    if( IS_GPIO_ALL_INSTANCE(ac->port)) {
      if( IS_GPIO_ALL_INSTANCE(GPIOA) && (ac->port == GPIOA) ) { __HAL_RCC_GPIOA_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOB) && (ac->port == GPIOB )) { __HAL_RCC_GPIOB_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOC) && (ac->port == GPIOC )) { __HAL_RCC_GPIOC_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOD) && (ac->port == GPIOD )) { __HAL_RCC_GPIOD_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOE) && (ac->port == GPIOE )) { __HAL_RCC_GPIOE_CLK_ENABLE(); }
//      else if( IS_GPIO_ALL_INSTANCE(GPIOH) && (ac->port == GPIOH )) { __HAL_RCC_GPIOH_CLK_ENABLE(); }
    } else {
      _status |= 4;
      return -1;
    }

    GPIO_InitStruct.Pin = (1 << (ac->pin)); //GPIO_PIN_n;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL; //GPIO_PULLDOWN; //GPIO_NOPULL;
    HAL_GPIO_Init(ac->port, &GPIO_InitStruct);
  }

  return ++_channel_num;
}

void stm32adc::start() {
  if( ! isready() ) return;

  if(HAL_ADC_Start(_ha) != HAL_OK) {
    ERROR_LOG(""); //Error_Handler();
  }
}

void stm32adc::stop() {
  if( ! isready() ) return;

  HAL_ADC_Stop(_ha);
}

void stm32adc::conv() {
  if( isready() ) {
    if(HAL_ADC_PollForConversion(_ha, this->_timeout) != HAL_OK) {
      ERROR_LOG(""); //Error_Handler();
    }
  }
}

int stm32adc::read() {
  if( ! isready() ) { 
    return (-1);
  }
  if( _mode == eADC_POLLING ) {
    start();
    
    if(HAL_ADC_PollForConversion(_ha, this->_timeout) != HAL_OK) {
    ERROR_LOG(""); //Error_Handler();
    }
  }

  uint32_t val = HAL_ADC_GetValue(_ha);  // get adc value

  if( _mode == eADC_POLLING ) {
    stop();
  }
  
  return (int)(val & (uint32_t)0xfffl);
}

int stm32adc::read(uint16_t *buf) {
  start();

  int i = 0;
  for(; i < _channel_num; i++ ) {
    if(HAL_ADC_PollForConversion(_ha, 1) != HAL_OK) {
    ERROR_LOG(""); //Error_Handler();
    }
    
