gauya/bluepill_cube/lib/stm32/src/gadc.cpp
    uint32_t v = HAL_ADC_GetValue(_ha);  // get adc value
    buf[i] = (uint16_t)(v & 0x0fffU);
  }

  stop();

  return i;
}

/// @brief ////////////////////////////////////////////////////////////////////////////////////////////////////

stm32adcint::stm32adcint() 
: stm32adc() {
  _mode = eADC_INTERRUPT;
  HUL_ADC_nvic(get_handle()->Instance, 1);
}

stm32adcint::stm32adcint(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)()) 
: stm32adc(adc, ac) {
  _mode = eADC_INTERRUPT;
  HUL_ADC_nvic(get_handle()->Instance, 1);
}

stm32adcint::~stm32adcint() {
  stop();
  
  HUL_ADC_nvic(get_handle()->Instance, 0);
  
  detach();
}

void stm32adcint::setup(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)()) {
  stm32adc::setup(adc, ac);
  attach(intrf);
}

void stm32adcint::start() {
  if( HAL_ADC_Start_IT(this->_ha) != HAL_OK ) {
    ERROR_LOG(""); //Error_Handler();
  }
}

void stm32adcint::stop() {
  if( ! isready() ) return;

  HAL_ADC_Stop_IT(get_handle());
}

void stm32adcint::attach( void (*inf)()) {
  _stm32adc_callback = inf;
}

void stm32adcint::detach() {
  _stm32adc_callback = (void(*)())0;
}

int stm32adcint::read() {
  if( ! isready() ) return -1;

  int val = stm32adc::read();
  return val;
}

// -------------------------------------------------------------------------------------------------

stm32adcdma::stm32adcdma() 
: stm32adc() {
  _dmabuf = 0;
  _mode = eADC_DMAINTERRUPT;
}

stm32adcdma::stm32adcdma(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)(), uint16_t *dmabuf) 
: stm32adc(adc, ac) {
  _mode = eADC_DMAINTERRUPT;
  _dmabuf = dmabuf;
}

void stm32adcdma::setup(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)(), uint16_t *dmabuf) {
  if( !dmabuf ) {
    _dmabuf = new uint16_t[channel_num()*2];
    _outbuf = new uint16_t[channel_num()*2];
  }

  HUL_ADC_nvic(get_handle()->Instance, 1);
  HUL_ADC_clk_enable(adc);
  HUL_DMA_nvic(adc,1);

#if 1  // F1

  hdma_adc1.Instance = DMA1_Channel1;
  hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;
  hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  hdma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
  hdma_adc1.Init.Mode = DMA_CIRCULAR;
  hdma_adc1.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
  {
    ERROR_LOG(""); //Error_Handler();
  }

#else  // F4

  hdma_adc1.Instance = DMA2_Stream0;
  hdma_adc1.Init.Channel = DMA_CHANNEL_0;
  hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;
  hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  hdma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
  hdma_adc1.Init.Mode = DMA_CIRCULAR;
  hdma_adc1.Init.Priority = DMA_PRIORITY_MEDIUM; //DMA_PRIORITY_LOW;
  hdma_adc1.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
  {
    ERROR_LOG(""); //Error_Handler();
  }

  hdma_adcp = &hdma_adc1;

#endif  

  __HAL_LINKDMA((_ha),DMA_Handle,hdma_adc1);

}

stm32adcdma::~stm32adcdma() {
  stop();
  if( _dmabuf ) {
    delete[]_dmabuf;
    _dmabuf = 0;
  }
}

void stm32adcdma::start() {
  if( ! isready() ) {
    ERROR_LOG("adc start not ready"); 
    return;
  }

#if 0
  stm32adcint::start(); 
  if( HAL_DMA_Start_IT(&hdma_adc1, (uint32_t)&ADC1->DR, (uint32_t)_dmabuf[0],  channel_num()) != HAL_OK ) {
      ERROR_LOG("adc dma start it nok"); 
  }
  if( HAL_ADC_Start(get_handle()) != HAL_OK ) {
    ERROR_LOG("adc start nok"); 
  }
 //  HAL_DMA_Start(&hdma_adc1, (uint32_t)&hadc1.Instance->DR, (uint32_t)_dmabuf, channel_num());
  if( HAL_ADC_Start(get_handle()) != HAL_OK ) {
    ERROR_LOG("adc start nok"); 
  }
  if( HAL_DMA_Start_IT(&hdma_adc1, (uint32_t)&ADC1->DR, (uint32_t)_dmabuf[0],  channel_num()) != HAL_OK ) {
      ERROR_LOG("adc dma start it nok"); 
  }
#else
 
  if( HAL_ADC_Start_DMA(get_handle(), (uint32_t*)_dmabuf, channel_num()) != HAL_OK ) {
    ERROR_LOG("adc start dma nok"); 
  };
#endif  
}

void stm32adcdma::stop() {
  if( ! isready() ) return;

  stm32adc::stop(); 
  HAL_ADC_Stop_DMA(get_handle());
}


void stm32adcdma::attach( void (*inf)()) {
  _stm32adc_callback = inf;
}

void stm32adcdma::detach() {
  _stm32adc_callback = (void(*)())0;
}

uint16_t *stm32adcdma::read() {

  return _dmabuf;
}

int stm32adcdma::read( uint16_t *bp) {
  if(adc_completed) {
    memmove(bp,_dmabuf,channel_num());
    adc_completed = 0;
    return channel_num();
  }
  return 0;
}

#if 0
#define ADC_CHANNEL_0           0x00000000U
#define ADC_CHANNEL_1           ((uint32_t)ADC_CR1_AWDCH_0)
#define ADC_CHANNEL_2           ((uint32_t)ADC_CR1_AWDCH_1)
#define ADC_CHANNEL_3           ((uint32_t)(ADC_CR1_AWDCH_1 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_4           ((uint32_t)ADC_CR1_AWDCH_2)
#define ADC_CHANNEL_5           ((uint32_t)(ADC_CR1_AWDCH_2 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_6           ((uint32_t)(ADC_CR1_AWDCH_2 | ADC_CR1_AWDCH_1))
#define ADC_CHANNEL_7           ((uint32_t)(ADC_CR1_AWDCH_2 | ADC_CR1_AWDCH_1 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_8           ((uint32_t)ADC_CR1_AWDCH_3)
#define ADC_CHANNEL_9           ((uint32_t)(ADC_CR1_AWDCH_3 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_10          ((uint32_t)(ADC_CR1_AWDCH_3 | ADC_CR1_AWDCH_1))
#define ADC_CHANNEL_11          ((uint32_t)(ADC_CR1_AWDCH_3 | ADC_CR1_AWDCH_1 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_12          ((uint32_t)(ADC_CR1_AWDCH_3 | ADC_CR1_AWDCH_2))
#define ADC_CHANNEL_13          ((uint32_t)(ADC_CR1_AWDCH_3 | ADC_CR1_AWDCH_2 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_14          ((uint32_t)(ADC_CR1_AWDCH_3 | ADC_CR1_AWDCH_2 | ADC_CR1_AWDCH_1))
#define ADC_CHANNEL_15          ((uint32_t)(ADC_CR1_AWDCH_3 | ADC_CR1_AWDCH_2 | ADC_CR1_AWDCH_1 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_16          ((uint32_t)ADC_CR1_AWDCH_4)
#define ADC_CHANNEL_17          ((uint32_t)(ADC_CR1_AWDCH_4 | ADC_CR1_AWDCH_0))
#define ADC_CHANNEL_18          ((uint32_t)(ADC_CR1_AWDCH_4 | ADC_CR1_AWDCH_1))

#define ADC_CHANNEL_VREFINT     ((uint32_t)ADC_CHANNEL_17)
#define ADC_CHANNEL_VBAT        ((uint32_t)ADC_CHANNEL_18)
/**
  * @}
  */

